04_OpenFoam/_ref/OpenFOAM-14/multicomponentFluid/DLR_A_LTS/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField
{
    type        zonal;

    defaultValue    292;

    zones
    {
        fuel
        {
            type            box;
            box             (0.002 -0.01 0.005) (0.02 0.01 0.055);
            value           2200;
        }
    }
}

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform 292;
    }

    inletair
    {
        type            fixedValue;
        value           uniform 292;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 292;
    }

    axis
    {
        type            empty;
    }

    leftside
    {
        type            zeroGradient;
    }

    burnerwall
    {
        type            zeroGradient;
    }

    burnertip
    {
        type            zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
